In [105]:
import numpy as np
import pandas as pd

In [106]:
df=pd.DataFrame({'col1':[1,2,3,4],
                 'col2':[444,555,666,444],
                 'col3':['abc','def','ghi','xyz']})

In [107]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [108]:
df['col2'].unique()

array([444, 555, 666])

In [109]:
len(df['col2'].unique())

3

In [110]:
df['col2'].nunique()

3

In [111]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [112]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [113]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [114]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [115]:
def times2(x):
    return x*2

In [116]:
times2(df)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [117]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [118]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [119]:
df[['col1','col2']].apply(lambda x:x*2)

   col1  col2
0     2   888
1     4  1110
2     6  1332
3     8   888

In [120]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [121]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [122]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [123]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [124]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [125]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [126]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [127]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [128]:
df.notnull()

   col1  col2  col3
0  True  True  True
1  True  True  True
2  True  True  True
3  True  True  True

In [129]:
d={'A':['foo','foo','foo','bar','bar','bar'],
      'B':['one','one','two','two','onw','onw'],
      'C':['x','y','x','y','x','y'],
      'D':[1,3,2,5,4,1]}

In [130]:
df=pd.DataFrame(d)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  onw  x  4
5  bar  onw  y  1

In [131]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar onw  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN